day25/app/controllers/items_controller.rb

  def create
    # if @item = Item.create(item_params)
    @item = Item.new(item_params)
    if @item.save
---
INSERT INTO "items" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Ice Cream"], ["created_at", "2015-02-09 14:42:27.444034"], ["updated_at", "2015-02-09 14:42:27.444034"]]

  def edit
    @item = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 5]]

  def update
    @item = Item.find(params[:id])
    @item.update_attributes(item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "items" SET "name" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["name", "Apple Pie"], ["updated_at", "2015-02-09 14:43:17.259562"], ["id", 5]]

  def destroy
    @item = Item.find(params[:id])
    @item.destroy!
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 5]]

  def search
    @items = Item.where("name LIKE ?", "%#{params[:search_item_name]}%")
---
SELECT "items".* FROM "items" WHERE (name LIKE '%Ice%')